In [1]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [2]:
df = titanic

In [3]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [5]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
import numpy as np
np.count_nonzero(df.isnull())

869

In [9]:
df.shape

(891, 15)

In [8]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [17]:
import pandas as pd

In [18]:
def count_null(X):
    null_X = pd.isnull(X)
    count_null = np.sum(null_X)
    return count_null

In [19]:
dsum_null = df.apply(count_null)

In [20]:
dsum_null

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [22]:
# 결측치 비율 구하기
def prop_null(X):
    tot_num = count_null(X)
    dem = X.size
    return tot_num/dem

per_null = df.apply(prop_null)
per_null

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [29]:
str(round(per_null['age'], 3)) + '%'

'0.199%'

In [30]:
import keyword
# print(keyword.kwlist)
kwlist = keyword.kwlist
for i in range(0,len(kwlist)):
    print("[{:10}]".format(kwlist[i]), end=" ")
    if (i+1)%5==0: print()

[False     ] [None      ] [True      ] [and       ] [as        ]
[assert    ] [async     ] [await     ] [break     ] [class     ]
[continue  ] [def       ] [del       ] [elif      ] [else      ]
[except    ] [finally   ] [for       ] [from      ] [global    ]
[if        ] [import    ] [in        ] [is        ] [lambda    ]
[nonlocal  ] [not       ] [or        ] [pass      ] [raise     ]
[return    ] [try       ] [while     ] [with      ] [yield     ]

In [31]:
df.size

13365

In [36]:
def prop_complete(X):
    return 1 - prop_null(X)
df.apply(prop_complete)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [42]:
xd = df.apply(prop_null)
xd.info()

<class 'pandas.core.series.Series'>
Index: 15 entries, survived to alone
Series name: None
Non-Null Count  Dtype
--------------  -----
15 non-null     float64
dtypes: float64(1)
memory usage: 796.0+ bytes

In [43]:
# 데이터 결측치 처리 - 행 방향
c_row = df.apply(count_null, axis=1)
p_row = df.apply(prop_null, axis=1)
pcom_row = df.apply(prop_complete, axis=1)

In [45]:
c_row.head(10)

0    1
1    0
2    1
3    0
4    1
5    2
6    0
7    1
8    1
9    1
dtype: int64

In [46]:
p_row.head(10)

0    0.066667
1    0.000000
2    0.066667
3    0.000000
4    0.066667
5    0.133333
6    0.000000
7    0.066667
8    0.066667
9    0.066667
dtype: float64

In [48]:
len(df.columns)

15

In [49]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [51]:
df['num_null'] = df.apply(count_null, axis=1)
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_null
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  num_null     891 non-null    int64
dtypes: bool(2), category(2), float64(2), int64(5), object(5)
memory usage: 87.6+ KB

In [54]:
df.loc[df.num_null > 1, :].sample(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_null
766,0,1,male,NaN,0,0,39.6000,C,First,man,True,NaN,Cherbourg,no,True,2
196,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2
168,0,1,male,NaN,0,0,25.9250,S,First,man,True,NaN,Southampton,no,True,2
428,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2
229,0,3,female,NaN,3,1,25.4667,S,Third,woman,False,NaN,Southampton,no,False,2
793,0,1,male,NaN,0,0,30.6958,C,First,man,True,NaN,Cherbourg,no,True,2
295,0,1,male,NaN,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True,2
126,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,2
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2

In [57]:
df.loc[df.num_null >= 1, :].sample(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_null
848,0,2,male,28.0,0,1,33.0000,S,Second,man,True,NaN,Southampton,no,False,1
620,0,3,male,27.0,1,0,14.4542,C,Third,man,True,NaN,Cherbourg,no,False,1
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
674,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True,2
660,1,1,male,50.0,2,0,133.6500,S,First,man,True,NaN,Southampton,yes,False,1
85,1,3,female,33.0,3,0,15.8500,S,Third,woman,False,NaN,Southampton,yes,False,1
500,0,3,male,17.0,0,0,8.6625,S,Third,man,True,NaN,Southampton,no,True,1
474,0,3,female,22.0,0,0,9.8375,S,Third,woman,False,NaN,Southampton,no,True,1
321,0,3,male,27.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,1
829,1,1,female,62.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True,2

In [58]:
df.loc[df.num_null > 1, :].sample(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_null
64,0,1,male,NaN,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True,2
481,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True,2
656,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,2
196,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2
846,0,3,male,NaN,8,2,69.5500,S,Third,man,True,NaN,Southampton,no,False,2
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True,2
793,0,1,male,NaN,0,0,30.6958,C,First,man,True,NaN,Cherbourg,no,True,2
533,1,3,female,NaN,0,2,22.3583,C,Third,woman,False,NaN,Cherbourg,yes,False,2
444,1,3,male,NaN,0,0,8.1125,S,Third,man,True,NaN,Southampton,yes,True,2
168,0,1,male,NaN,0,0,25.9250,S,First,man,True,NaN,Southampton,no,True,2